<template>
  <div class="about">
    <div class="container">
      <div class="about__content">
        <div class="about__text">
          <p class="about__description">
            Есть много вариантов Lorem Ipsum, но большинство из них имеет не
            всегда приемлемые модификации, например, юмористические вставки или
            слова, которые даже отдалённо не напоминают латынь. Если вам нужен
            Lorem Ipsum для серьёзного проекта, вы наверняка не хотите
            какой-нибудь шутки, скрытой в середине абзаца. Также все другие
            известные генераторы Lorem Ipsum используют один и тот же текст,
            который они просто повторяют, пока не достигнут нужный объём. Это
            делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum
            генератором. Он использует словарь из более чем 200 латинских слов, а
            также набор моделей предложений. В результате сгенерированный Lorem
            Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или
            "невозможных" слов.Есть много вариантов Lorem Ipsum, но большинство из
            них имеет не всегда приемлемые модификации, например, юмористические
            вставки или слова, которые даже отдалённо не напоминают латынь. Если
            вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите
            какой-нибудь шутки, скрытой в середине абзаца. Также все другие
            известные генераторы Lorem Ipsum используют один и тот же текст,
            который они просто повторяют, пока не достигнут нужный объём. Это
            делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum
            генератором. Он использует словарь из более чем 200 латинских слов, а
            также набор моделей предложений. В результате сгенерированный Lorem
            Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или
            "невозможных" слов.Есть много вариантов Lorem Ipsum, но большинство из
            них имеет не всегда приемлемые модификации, например, юмористические
            вставки или слова, которые даже отдалённо не напоминают латынь. Если
            вам нужен Lorem Ipsum для серьёзного проекта, вы наверняка не хотите
            какой-нибудь шутки, скрытой в середине абзаца. Также все другие
            известные генераторы Lorem Ipsum используют один и тот же текст,
            который они просто повторяют, пока не достигнут нужный объём. Это
            делает предлагаемый здесь генератор единственным настоящим Lorem Ipsum
            генератором. Он использует словарь из более чем 200 латинских слов, а
            также набор моделей предложений. В результате сгенерированный Lorem
            Ipsum выглядит правдоподобно, не имеет повторяющихся абзацей или
            "невозможных" слов.
          </p>

          <p class="about__cooperation">
            ©Kara
          </p>
        </div>

        <div class="about__gallery">
          <img
            src="../../assets/img/kara-3.jpg"
            alt=""
            class="about__image"
          />
        </div>
      </div>
    </div>
  </div>
</template>

<script lang="ts"></script>

<style lang="scss" scoped>
.about {
  &__content {
    display: flex;
    justify-content: space-between;
    padding: 60px;
    color: var(--color-white);

    @media (max-width: 670px) {
      flex-direction: column-reverse;
      padding: 40px;
    }

    @media (max-width: 420px) {
      padding: 30px 20px;
    }
  }

  &__text {
    max-width: 50%;

    @media (max-width: 670px) {
      float:left;
      max-width: 100%;
    }
  }

  &__description {
    line-height: 1.5;
    font-size: 15px;
    font-weight: 300;
  }

  &__cooperation {
    text-align: end;
    font-size: 25px;
  }

  &__gallery {
    margin-top: 100px;

    @media (max-width: 670px) {
      margin: 0;
    }
  }

  &__image {
    width: 300px;
    height: 300px;
    transition: all 0.3s ease-in-out;

    @media (max-width: 750px) {
      width: 200px;
      height: 200px;
    }
  }
}
</style>
